In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    "Product": ["Laptop", "Headphones", "Coffee Mug", "Backpack"],
    "Category": ["Electronics", "Accessories", "Kitchen", "Travel"],
    "Price": [1299, 199, 15, 89]
})

data

      Product     Category  Price
0      Laptop  Electronics   1299
1  Headphones  Accessories    199
2  Coffee Mug      Kitchen     15
3    Backpack       Travel     89

In [3]:
# Create a new column by subtracting 10 from each price

data["Discounted"] = data["Price"].apply(lambda x: x - 10)

In [4]:
data

      Product     Category  Price  Discounted
0      Laptop  Electronics   1299        1289
1  Headphones  Accessories    199         189
2  Coffee Mug      Kitchen     15           5
3    Backpack       Travel     89          79

In [7]:
# Creating a new column for check if products are tech or not

data["Category_Flag"] = data["Category"].apply(
    lambda x: "Tech" if x in ["Electronics", "Accessories"] else "Non-Tech"
)

In [8]:
data

      Product     Category  Price  Discounted Category_Flag
0      Laptop  Electronics   1299        1289          Tech
1  Headphones  Accessories    199         189          Tech
2  Coffee Mug      Kitchen     15           5      Non-Tech
3    Backpack       Travel     89          79      Non-Tech